function GetPoint(key)
	return pointMap[key][1],pointMap[key][2]
end

pointMap = {

	B服确认 = {98,760},
	开始唤醒 = {210,630},
	终端 = {557,963},
	集成战略 = {45,1036},
	返回 = {681,95},
	导航 = {682,267},
    导航_首页 = {450,86},
    关闭主页公告 = {649,1204},
	进入主题 = {188,1027},
    萨米肉鸽 = {215,228},
    跳过剧情 = {667,1173},
    确认跳过剧情 = {356,797},
    开始探索 = {99,1140},
    肉鸽结算SKIP = {682,1195},
    
    第一个干员 = {579,562},
    第二个干员 = {440,587},
    第三个干员 = {303,572},
    第四个干员 = {167,579},
    
    难度选择 = {227,1136},
    确认难度选择 = {339,1159},
    难度选择上 = {487,789},
    难度选择下 = {173,869},
    
    指挥分队 = {130,170},
    第二分队 = {131,466},
    第三分队 = {139,743},
    
    取长补短 = {132,781},
    
    文化比较 = {287,213},
    文化比较确认升级 = {49,1194},
    文化比较向右滑动 = {392,1242},
    
    初始招募券1 = {179,352},
    初始招募券2 = {180,642},
    初始招募券3 = {178,931},
    
    初始节点1 = {459,623},
	初始节点2 = {338,624},
    诡异行商节点1 = {458,862},
	诡异行商节点2 = {336,861},
    
    选择助战 = {686,1106},
    招募助战 = {197,853},
    SKIP = {675,1220},
    放弃招募 = {41,978},
    确认招募 = {44,1235},
    确认 = {222,841},
    探索开始 = {364,1198},
    关闭教程 = {611,156},
    节点出发前往 = {270,1114},
    快速编队 = {680,1011},
    快速编队干员列表1 = {579,574},
    快速编队干员技能2 = {185,48},
    快速编队确认 = {41,1132},
    开始行动 = {48,1073},
    二倍速 = {667,1099},
    
    肉鸽玩法介绍关闭 = {611,155},
    
	肉鸽返回 = {685,42},
    放弃本次探索 = {423,1137},
    肉鸽结算确认 = {104,654},
    作战结算奖励收下1 = {207,474},
    作战结算奖励收下2 = {208,803},
    
    收下 = {189,166},
    
    干员列表1 = {70,1220},
    
    商店货物1 = {489,712},
    商店货物2 = {486,922},
    商店货物3 = {494,1126},
    商店货物4 = {284,518},
    商店货物5 = {284,717},
    商店货物6 = {285,920},
    确认购买 = {221,982},
    离开商店 = {171,1230},
    
    事件选项1_1 = {309,1198},
    事件选项2_1 = {391,1197},
    事件选项2_2 = {224,1197},
    事件选项3_1 = {473,1197},
    事件选项3_2 = {309,1197},
    事件选项3_3 = {145,1196},
    
    关闭获得物品面板 = {199,639},
    
    --萨米肉鸽作战干员位置
	苔手干员实际位置 = {465,890},
    苔手干员偏差位置 = {492,1026},
    待宰的兽群干员实际位置 = {358,879},
    待宰的兽群干员偏差位置 = {345,995},
	度假村冤魂干员实际位置 = {398,384},
    度假村冤魂干员偏差位置 = {352,514},
    死囚之夜干员实际位置 = {236,546},
    死囚之夜干员偏差位置 = {220,640},

	更新助战列表 = {686,1182},
    前瞻性投资系统 = {491,500},
    投资入口 = {366,673},
    确认投资 = {221,984},
}

function GetPointListMap(key)
	return pointListMap[key]
end

pointListMap = {
	
	文化比较列表 = {
    	
        --第一个是为点击的未偏差位置
        {339,238},
        {245,383},
        {535,385},
		{388,525},
        {273,641},
        {507,646},
        {391,709},
        
		{273,280},
        {171,381},
        {287,384},
        {170,525},
        {388,281},
        {493,382},
        {276,653},
        {389,487},
        {391,710},
        {503,276},
        {607,382},
        {608,521},
        {503,652},
        
		{274,278},
        {172,384},
        {169,526},
        {275,652},
        {389,278},
        {287,381},
        {493,384},
        {387,486},
        {387,710},
        {505,281},
        {606,384},
        {609,521},
        {504,651},
        
		{277,897},
        {389,897},
        {173,1002},
        {292,1002},
        {492,1000},
        {505,901},
        {612,1002},
        
    }
    
}

function GetColor(key)
	return colorMap[key]
end

colorMap = {
	
    资源检测界面 = "63|640|00D7FF,14|640|00D7FF",
    B服确认 = "111|720|E5AD23,111|735|FFFEFC",
    开始唤醒 = "216|604|E6E6E6,216|645|F6F6F6,217|692|565655",
    终端 = "584|920|323232,534|913|323232,545|935|EBEBEA,586|998|323232,539|1024|323232,564|1032|E9E9E8",
	返回与导航界面 = "680|37|EFEFEF,682|107|313131,687|162|050404,680|267|D8D8D8",
    保护目标图标 = "704|683|FAA500,702|697|FFFFFF",
    关闭主页公告 = "650|1203|BFBFBF,659|1194|BFBFBF,641|1212|BFBFBF,628|1203|595959",
    跳过剧情 = "660|1210|FBFAFA,672|1210|FFFFFF,666|1217|FFFFFF",
    登录认证失效 = "397|474|FFFFFF,397|501|FEFEFE,397|559|FCFCFC,395|630|FFFFFF,394|649|FFFFFF,195|923|0B0B0B,345|1112|343434,555|1279|3D3D3D",
    
    进入主题 = "200|1080|F1F1F1,195|1127|F7F7F7,178|1148|F8F8F8,194|1167|F8F8F8",
    主页面挑战自然 = "236|1135|7D7D7A,236|1145|797772,233|1163|BCBBB6",
    得分效率 = "448|99|6D6D6D,451|151|6A6969",
    研究完成 = "274|201|ABA99E,266|220|B8B6B0,266|236|B6B3AC,269|255|B6B4AF",
    肉鸽结算SKIP = "689|1183|C6C6C6,689|1205|C6C6C6,681|1207|C1BFBA",
    
    选择分队 = "695|641|E9E7E1,695|708|F4F3F0",
    选择支援 = "692|674|F4F3F0,677|674|F4F3F0,694|698|F4F3EF",
    选择招募组合 = "695|654|F4F3F0,694|705|F4F3F0,684|721|F4F3F0",
    初始招募 = "693|638|F4F3F0,694|681|F4F3F0,695|701|F4F3F0",
    
    后勤分队1 = "268|408|FFFFFF,249|406|FFFFFF,249|413|FFFFFF,254|437|FFFFFF",
    后勤分队2 = "268|692|FFFFFF,249|690|FFFFFF,253|721|FFFFFF,249|732|FFFFFF",
    
    初始近卫招募券 = "357|301|FFFFFF,342|325|FFFFFF",
    初始辅助招募券 = "358|581|F1F1F0,361|619|FFFFFF",
    初始医疗招募券 = "359|872|FFFFFF,361|906|FEFEFE",
    初始先锋招募券 = "361|302|FFFFFF,349|326|FEFEFE",
    
    确认招募 = "42|1098|A57500,36|1115|FFFFFF,51|1144|FEFEFD,52|1213|F9F5ED",
    通用红色确认 = "225|826|FFFFFF,208|839|FFFFFF,223|833|10116D,234|1132|101073",
    
    探索冰原 = "404|1173|FEFEFE,361|1189|FFFFFF",
    肉鸽玩法介绍关闭 = "614|154|F7F7F7,614|173|FEFEFE,617|188|FFFFFF",
    
    初始双节点1 = "467|706|684154,443|707|5A3B4A",
    初始双节点2 = "347|474|75445C,321|468|643F51",
	初始三节点1 = "475|475|6E4157,460|470|7F4966,445|469|6E4258",
    初始三节点2 = "354|709|653E51,339|707|704359,324|708|643E51",
    第二列三节点1 = "462|737|302423,462|784|281D1A",
    第二列三节点2 = "341|737|261C19,341|760|2B1F1E",
    第二列三节点3 = "220|737|221716,220|768|281E1C",
    第三列三节点1 = "462|1187|201716,462|1212|1F1714",
    第三列三节点2 = "341|1187|1E1514,341|1201|1E1614",
    第三列三节点3 = "220|1187|201716,220|1214|1E1614",
    
    --萨米肉鸽关卡
	苔手 = "570|972|F8F8F8,557|1026|F2F2F2",
	待宰的兽群 = "558|972|F9F9F9,565|1002|EEEEEE,549|1034|FFFFFF,563|1064|FFFFFF",
    度假村冤魂 = "558|974|FFFFFF,562|1004|FFFFFF,558|1036|FDFDFD,554|1074|F6F6F6,563|1106|FFFFFF",
    死囚之夜 = "571|972|FFFFFF,570|1003|FFFFFF,557|1011|FEFEFE,567|1046|FFFFFF,553|1066|FFFFFF",
    
    --萨米肉鸽不期而遇
    揭下它 = "420|893|BABABA,403|909|BABABA,413|923|B8B8B8,401|951|B0B0AF",
    请求生存 = "576|893|B8B8B8,580|947|B9B9B9,569|965|B7B7B7",
    你迷路了 = "248|893|A6A5A5,254|926|B4B4B4,253|991|BBBBBB",
    检查探测器 = "503|893|BABABA,501|948|BABABA,502|987|B3B2B2",
    为什么这里满地都是乌萨斯人 = "579|890|A1A19F,570|1118|B1B0B0,577|1161|AEADAC",
    把他的探测器举到他面前 = "503|892|B3B3B3,498|1035|BABABA,496|1113|BBBBBB",
    和鼷兽玩 = "483|894|B4B4B4,487|934|B6B6B6,484|978|BBBBBB",
    离开 = "253|890|ACACAB,254|915|9D9C9B,245|933|BABABA",
    
    劲爆刺激但是该离开了 = "336|890|B5B5B4,335|962|B8B8B8,336|1155|B8B8B8",
    
    成功通过 = "189|37|FFFFFF,141|88|FFFFFF,188|115|FFFFFF,142|130|FFFFFF,156|202|FFFFFF,187|298|FFFFFF",
	确认招募 = "43|1069|A87500,38|1104|A87500,42|1125|FAF7F1,42|1141|FCFAF5,41|1198|F5EFE1",
    拿到双密文版 = "219|460|070801,218|477|232506,208|507|BFCC1F",
    
    希望 = "698|862|00D9FD,692|876|004E82,698|889|00D9FF",
    玩法介绍 = "710|89|5D5A58,674|120|999694",
    
    亮起的诡异行商 = "296|557|F6F7F3,292|680|FEFDFB,300|747|5B682A,283|747|F4F5F0",
    退出肉鸽 = "708|20|00005C,686|43|FFFFFF,706|63|00005C",
    源石锭不足 = "233|940|666C53,233|956|6B7159,232|979|666C54,233|998|696F56,233|1021|70775C",
    
    肉鸽空编队 = "546|199|FFFFFF,545|241|FFFFFF",
    
    等待科考队重建 = "133|1061|EEEEEE,134|1090|F2F2F2,137|1133|F0F0F0,138|1170|DCDBDB,138|1202|BFBFBF",
    放弃本次探索 = "441|1121|3E33BB,405|1155|3C35B7",
    驻足于 = "282|1038|F4F4F4,282|1062|FEFEFD,276|1067|FCFCFB",
    文化比较 = "299|240|D8D8D8,287|240|D6D6D6,285|261|CCCCCC",
    难度选择挑战自然 = "350|423|FEFEFE,349|455|FFFFFF,346|483|FEFEFE",
    难度选择确认 = "353|1209|FFFFFF,352|1227|FFFFFF",
    
    联系中断 = "363|561|FFFFFF,346|612|FFFFFF,358|643|FFFFFF",
    投资受限 = "423|726|FFFFFF,423|788|E9EAE9,421|820|FEFEFE",
}

function GetChannel(key)
	return channelMap[key]
end

channelMap = {

	官服 = "com.hypergryph.arknights",
    B服 = "com.hypergryph.arknights.bilibili",

}